---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SlantedColumnBaseCutStyle
source: html/74aa151d-25ba-3449-25fa-34e39b58358e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SlantedColumnBaseCutStyle Property

"Base Cut Style"

## Syntax (C#)
```csharp
public static ForgeTypeId SlantedColumnBaseCutStyle { get; }
```